[
  {
    "productId": "4c4b7d2f-42c6-4d96-aeb3-4c9db63995ca",
    "userId": "752160e2-cd14-4e8b-bc85-5ab6af8a30f5",
    "text": "Battery life is amazing, one charge over night and it’s alive all day, the camera is definitely better quality. The audio is very loud which is a good thing. The only problem is that I’ve only had the phone for like 5 days and it’s been freezing on me sometimes which is definitely worrisome"
  },
  {
    "productId": "4c4b7d2f-42c6-4d96-aeb3-4c9db63995ca",
    "userId": "0120e324-1737-4f12-a063-63adb58dd96e",
    "text": "100% the phone is good but the network cricket wireless please please it's not good don't go through doctor Carrier it's a really bad service I live in Minneapolis and I'm getting"
  },
  {
    "productId": "4c4b7d2f-42c6-4d96-aeb3-4c9db63995ca",
    "userId": "0120e324-1737-4f12-a063-63adb58dd96e",
    "text": "This IPhone pro max is the absolute valued phone for the price, Amazon offer is the great value amongst any retailer that I believe in."
  },
  {
    "productId": "4c4b7d2f-42c6-4d96-aeb3-4c9db63995ca",
    "userId": "270c7b06-1d72-4a2e-8d51-9a938a9e2090",
    "text": "Lovely phone. Great battery life and brilliant camera setup. Only negative the lenses are way bulky now on the 13 design."
  },
  {
    "productId": "4c4b7d2f-42c6-4d96-aeb3-4c9db63995ca",
    "userId": "286617cc-e1e5-4c54-b2d9-0bc143058b8f",
    "text": "Good phone from Apple in 2020"
  },
  {
    "productId": "4c4b7d2f-42c6-4d96-aeb3-4c9db63995ca",
    "userId": "752160e2-cd14-4e8b-bc85-5ab6af8a30f5",
    "text": "Super disappointed when I got this phone. I rarely leave reviews but when I opened this phone I was aggravated. Screen has scratches and the outside edges of the phone are dirty. This is clearly not a refurbished phone, so it should not be advertised as such. Now I have to wait for another one which is even more aggravating!"
  },
  {
    "productId": "4c4b7d2f-42c6-4d96-aeb3-4c9db63995ca",
    "userId": "286617cc-e1e5-4c54-b2d9-0bc143058b8f",
    "text": "The screen was cracked and the phone did not turn in after 24 hours of charging."
  },
  {
    "productId": "4c4b7d2f-42c6-4d96-aeb3-4c9db63995ca",
    "userId": "7bb80385-eb46-4bfd-a017-8eafa0d4e980",
    "text": "This product is falsely labeled as unlocked, it's been 4 weeks since I informed that the phone was still locked and all I get are excuses. Plus, the phone came in a really bad condition, so many scratches you can see them very clearly."
  },
  {
    "productId": "4c4b7d2f-42c6-4d96-aeb3-4c9db63995ca",
    "userId": "0120e324-1737-4f12-a063-63adb58dd96e",
    "text": "This IPhone 13 Pro has been phenomenal. The speed at which it operates is Incredible. If you are questioning this buy, don’t. It’s a wonderful deal. I’ve not had one issue thus far, and will most certainly update this review if I have one within the warranty period. I recommend getting a tempered glass screen and a good case—this phone is glass front and back."
  },
  {
    "productId": "4c4b7d2f-42c6-4d96-aeb3-4c9db63995ca",
    "userId": "270c7b06-1d72-4a2e-8d51-9a938a9e2090",
    "text": "I loved how new this phone looks and works. Everything works and the battery life was at 94% which is very good. I am very glad with this purchase and definitely recommend buying from them. Very skeptical before buying but now having the product it is definitely worth a buy if you are looking for a good phone"
  },
  {
    "productId": "18bfcc97-d1e2-4f47-9d1b-71bc41f5934c",
    "userId": "752160e2-cd14-4e8b-bc85-5ab6af8a30f5",
    "text": "I'm rewriting my review because i bought this keyboard brand new and the shift button on this keyboard was very iffy to begin but i shrugged it off because it was at least working. But now it just plainly does not work. I have to get a new keyboard due to this"
  },
  {
    "productId": "18bfcc97-d1e2-4f47-9d1b-71bc41f5934c",
    "userId": "0120e324-1737-4f12-a063-63adb58dd96e",
    "text": "I've bought this keyboard twice now. It looks and feels great, and with both keyboards, keys start getting bound to each other for no reason. Last time, every time I hit my R key, the keyboard would enter ER. Now, when I hit the 1 key, it enters 12 every single time. I've popped off those caps a dozen times, tried compressed air to maybe move something around. Reinstalled drivers, updates, restarted, windows updates, changes usb ports, nothing works. Great for aesthetic purchases. Terrible for reliability."
  },
  {
    "productId": "18bfcc97-d1e2-4f47-9d1b-71bc41f5934c",
    "userId": "270c7b06-1d72-4a2e-8d51-9a938a9e2090",
    "text": "A backlit keyboard that doesn't sound like a bucket of marbles when you type. A huge plus. Space bar squeeked when I got it - had to pull that off and grease it. Also, it took me a bit to notice it, but the Shift characters are UNDER the main characters. What are they thinking - that's so weird."
  },
  {
    "productId": "18bfcc97-d1e2-4f47-9d1b-71bc41f5934c",
    "userId": "0120e324-1737-4f12-a063-63adb58dd96e",
    "text": "The shift function is usually signified with an UP arrow. When you look at the ? key, the ? should be on top of the /. The $ should be above the 4. This keyboard has the symbols reversed! bugs the hell out of me, but it works."
  },
  {
    "productId": "18bfcc97-d1e2-4f47-9d1b-71bc41f5934c",
    "userId": "752160e2-cd14-4e8b-bc85-5ab6af8a30f5",
    "text": "So technically this is a bit of a downgrade from my old Razor Huntsman Elite. However, I'm a lap-typer as in I primarily keep my keyboard in my lap when I type and that Huntsman was heavy and bigger than I needed or wanted. Picked this up as a lighter, smaller alternative and I love it! The lighting, while not as precise, is still very nice as I like to customize certain keys to be lit up in certain colors. There is significant bleed when you have two certain competing colors programmed to be right next to eachother but it doesn't bother me too much. Definitely a 5 star keyboard for the price!"
  },
  {
    "productId": "18bfcc97-d1e2-4f47-9d1b-71bc41f5934c",
    "userId": "286617cc-e1e5-4c54-b2d9-0bc143058b8f",
    "text": "I used a mechanical keyboard for a year and it's just not for me. So I went back to this Keyboard and man am I blown away. The feel in a Razer keyboard is amazing, even in this cheap model."
  },
  {
    "productId": "18bfcc97-d1e2-4f47-9d1b-71bc41f5934c",
    "userId": "0120e324-1737-4f12-a063-63adb58dd96e",
    "text": "I bought this keyboard because the keyboard that came with my pc tower stopped working. I knew I wanted my next keyboard to be geared more towards gaming. My tower also lights up, so if the keyboard has lights too, that's even better. The Razer Cynosa V2 keys themselves have grooves like a skateboard vertical ramp. You can move left or right. It's smooth. In the Chroma customization, you can choose the colors and where you want them to light up. They have presets (numbers, letters, etc) so you can easily select the colors you want in the basic areas. I had a more detailed scheme in mind. The purple, light blue, and blue seem to blur into each other. Choosing a white color in between seems to help. As you can see there is a lot of fun lighting you can do with this keyboard..and it's comfortable for gaming."
  },
  {
    "productId": "18bfcc97-d1e2-4f47-9d1b-71bc41f5934c",
    "userId": "752160e2-cd14-4e8b-bc85-5ab6af8a30f5",
    "text": "I use this on a 2nd computer. I really do like it. Very much. But I gave it 4 stars simply because Razer, for some reason, has decided to not include independent macro keys. Lighting is fine, and someone in their infinite wisdom decided to light up the !@#$%^&*()_+ keys (unlike the Blackwidow keyboards), which is great! As usual for Razer, the software can sometimes be a pain, and if you have an older Razer product, you'll need to use 2 different versions of their software... That really makes no sense! Don't get me wrong... I'm really happy with my purchase, I just wish Razer would incorporate all of their products into a single software package, and bring back independent macro keys!"
  },
  {
    "productId": "18bfcc97-d1e2-4f47-9d1b-71bc41f5934c",
    "userId": "270c7b06-1d72-4a2e-8d51-9a938a9e2090",
    "text": "Great quality keyboard, but the synapse program is horrible. I didn't really care for all the extra features I just wanted a good quality keyboard. Keyboard is awesome, its hefty and the keys feel great. After the first few days of owning it I uninstalled the synapse program because it just causes constant problems with the lighting and sometimes even the keyboard itself. Often I'd have to completely restart my computer to get the lights to turn back on, ending processes and restarting synapse wouldn't work half the time. Soft to type slight click with bright LEDS works wit OpenRGB so you dont need Synaspe from Razer"
  },
  {
    "productId": "18bfcc97-d1e2-4f47-9d1b-71bc41f5934c",
    "userId": "286617cc-e1e5-4c54-b2d9-0bc143058b8f",
    "text": "It’s absolutely amazing. No sticking keys, completely customizable lighting, no weird steps to setting it up, two different levels of kickstands, 3 different ways to route the cable, absolutely no complaints."
  },
  {
    "productId": "0d65066a-e6ed-4391-ba4a-0c2b442ce936",
    "userId": "0120e324-1737-4f12-a063-63adb58dd96e",
    "text": "My daughter in law said it fit perfectly in the pillow case I bought separately. Thank you"
  },
  {
    "productId": "0d65066a-e6ed-4391-ba4a-0c2b442ce936",
    "userId": "7bb80385-eb46-4bfd-a017-8eafa0d4e980",
    "text": "This pillow is so soft and fluffy. It’s perfect for what I want to use it for. I am very pleased with this"
  },
  {
    "productId": "0d65066a-e6ed-4391-ba4a-0c2b442ce936",
    "userId": "752160e2-cd14-4e8b-bc85-5ab6af8a30f5",
    "text": "Could be a better price"
  },
  {
    "productId": "0d65066a-e6ed-4391-ba4a-0c2b442ce936",
    "userId": "270c7b06-1d72-4a2e-8d51-9a938a9e2090",
    "text": "lumbar throw works great as a nightly sleeping pillow for between your legs. BUT you will need to put it inside a pillow case, I did and it still popped a seem hole that I needed to sew."
  },
  {
    "productId": "0d65066a-e6ed-4391-ba4a-0c2b442ce936",
    "userId": "0120e324-1737-4f12-a063-63adb58dd96e",
    "text": "Poor quality. Stuffing didn’t fill the case cover. I returned it the day after I received it."
  },
  {
    "productId": "0d65066a-e6ed-4391-ba4a-0c2b442ce936",
    "userId": "286617cc-e1e5-4c54-b2d9-0bc143058b8f",
    "text": "Awful! I'd give it zero stars if that were an option. Basically fiberfill in a thin pillowcase. AWFUL!"
  },
  {
    "productId": "0d65066a-e6ed-4391-ba4a-0c2b442ce936",
    "userId": "270c7b06-1d72-4a2e-8d51-9a938a9e2090",
    "text": "i don't know why i keep this item for. when i opened the package and checked the item, i found out this was an useless item, other than the softness, there was nothing, zero support and comfort. sorry to say this but it was a fact."
  },
  {
    "productId": "0d65066a-e6ed-4391-ba4a-0c2b442ce936",
    "userId": "752160e2-cd14-4e8b-bc85-5ab6af8a30f5",
    "text": "A “get what you pay for” situation. It’s fine, comfortable… but cheap for sure"
  },
  {
    "productId": "0d65066a-e6ed-4391-ba4a-0c2b442ce936",
    "userId": "0120e324-1737-4f12-a063-63adb58dd96e",
    "text": "Pillows are an individual taste. I love this pillow to lay my head on and to support my neck. It is so comfy. However, it is not firm enough for behind the back. It needs more fiberfill to take up the space in corners; no zipper is attached."
  },
  {
    "productId": "0d65066a-e6ed-4391-ba4a-0c2b442ce936",
    "userId": "286617cc-e1e5-4c54-b2d9-0bc143058b8f",
    "text": "Just an average pillow, smaller in size. More decorative than supportive"
  },
  {
    "productId": "9d2754f6-43a4-4944-80ce-2ab0adbc09c8",
    "userId": "752160e2-cd14-4e8b-bc85-5ab6af8a30f5",
    "text": "Read in multiple reviews that it would good for cooking for two people, NO WAY! This is for small side dishes or one person"
  },
  {
    "productId": "9d2754f6-43a4-4944-80ce-2ab0adbc09c8",
    "userId": "0120e324-1737-4f12-a063-63adb58dd96e",
    "text": "The product is good but I saw you need to do hard cleaning if your are making beans related things."
  },
  {
    "productId": "9d2754f6-43a4-4944-80ce-2ab0adbc09c8",
    "userId": "270c7b06-1d72-4a2e-8d51-9a938a9e2090",
    "text": "Doesn’t slow cook worth a crap. Tough , watery rubbery meat. Was afraid to use the pressure cooker selection. Had sooo many perple sautéed hey had the same problems. And was advised to go back to the originator nap slow cooker for roasts."
  },
  {
    "productId": "9d2754f6-43a4-4944-80ce-2ab0adbc09c8",
    "userId": "7bb80385-eb46-4bfd-a017-8eafa0d4e980",
    "text": "wish I would have gotten the instant pot long time ago..so easy to use."
  },
  {
    "productId": "9d2754f6-43a4-4944-80ce-2ab0adbc09c8",
    "userId": "286617cc-e1e5-4c54-b2d9-0bc143058b8f",
    "text": "I sure like this. Makes life easy"
  },
  {
    "productId": "9d2754f6-43a4-4944-80ce-2ab0adbc09c8",
    "userId": "752160e2-cd14-4e8b-bc85-5ab6af8a30f5",
    "text": "I had a different brand 5 years back. This time I bought Instant Pot and love it. I wish they would include some basic recipes in the package. That would be awesome."
  },
  {
    "productId": "9d2754f6-43a4-4944-80ce-2ab0adbc09c8",
    "userId": "286617cc-e1e5-4c54-b2d9-0bc143058b8f",
    "text": "now i see why i find them in yard sales and flea market.need to pre cook allmost everything before you put in pot.Just cook on stove its faster and eaiser.Not impressed at all."
  },
  {
    "productId": "9d2754f6-43a4-4944-80ce-2ab0adbc09c8",
    "userId": "0120e324-1737-4f12-a063-63adb58dd96e",
    "text": "It's so versatile and the amount of things you can do with this pot is endless ."
  },
  {
    "productId": "9d2754f6-43a4-4944-80ce-2ab0adbc09c8",
    "userId": "270c7b06-1d72-4a2e-8d51-9a938a9e2090",
    "text": "I wish this product had a more comprehensive description on how to use it and how to cook at least a few items. The front plate has numerous buttons but there's no good guide as to how ingredients are introduced. This cooker doesn't save much cooking time either looking at recipes online. I dont see I will use this for much of anything. My slow cooker will work easily and is far simpler."
  },
  {
    "productId": "9d2754f6-43a4-4944-80ce-2ab0adbc09c8",
    "userId": "752160e2-cd14-4e8b-bc85-5ab6af8a30f5",
    "text": "A little disappointed because I have only used it for about 18 days. The pressure cooker no longer turns on and I have tried plugging into other outlets. I have contacted InstantPot customer service and hope to get a response back soon."
  },
  {
    "productId": "5e4c4146-2171-4102-a4a6-245675a190e7",
    "userId": "0120e324-1737-4f12-a063-63adb58dd96e",
    "text": "nice. got complements on the contrast, looks overall very good."
  },
  {
    "productId": "5e4c4146-2171-4102-a4a6-245675a190e7",
    "userId": "270c7b06-1d72-4a2e-8d51-9a938a9e2090",
    "text": "My son wore this shirt for his homecoming dance. It fit true to size and the color was perfect. We haven't washed it yet, so not sure about the product after it's washed."
  },
  {
    "productId": "5e4c4146-2171-4102-a4a6-245675a190e7",
    "userId": "286617cc-e1e5-4c54-b2d9-0bc143058b8f",
    "text": "Love the shirt, just wrinkles very easily and was a nightmare to get shirt steamed. All in all it’s a great product for the price."
  },
  {
    "productId": "5e4c4146-2171-4102-a4a6-245675a190e7",
    "userId": "7bb80385-eb46-4bfd-a017-8eafa0d4e980",
    "text": "Poor material and stitching"
  },
  {
    "productId": "5e4c4146-2171-4102-a4a6-245675a190e7",
    "userId": "752160e2-cd14-4e8b-bc85-5ab6af8a30f5",
    "text": "Worst Packaging Ever!. Ruined the shirt. The shirt was bundled like a rag and thrust in a plastic clear through bag. The shirt looked like a rag when removed from the clear see through plastic."
  },
  {
    "productId": "5e4c4146-2171-4102-a4a6-245675a190e7",
    "userId": "0120e324-1737-4f12-a063-63adb58dd96e",
    "text": "I do not like the way it look. It does not match how these are shown in the web side. It does not fit properly.Easily wrinkles, not as nice as pictured but still ok and good quality! Arrived very quickly"
  },
  {
    "productId": "5e4c4146-2171-4102-a4a6-245675a190e7",
    "userId": "270c7b06-1d72-4a2e-8d51-9a938a9e2090",
    "text": "Size was slightly larger than expected but its fabric is good and I like it."
  },
  {
    "productId": "5e4c4146-2171-4102-a4a6-245675a190e7",
    "userId": "286617cc-e1e5-4c54-b2d9-0bc143058b8f",
    "text": "If your size is Large just order size Medium. So it’s one size larger than the standard."
  },
  {
    "productId": "5e4c4146-2171-4102-a4a6-245675a190e7",
    "userId": "752160e2-cd14-4e8b-bc85-5ab6af8a30f5",
    "text": "Received as product is described. Very comfortable shirt."
  },
  {
    "productId": "5e4c4146-2171-4102-a4a6-245675a190e7",
    "userId": "752160e2-cd14-4e8b-bc85-5ab6af8a30f5",
    "text": "Fit snuggle but loose. Easily to roll up sleeves. Durable material. Not easily to be wrinkled. Sheerness was not dull or too much on eyes. Great quality for the price paid."
  }
]
